In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('data/world_cities.csv')
df

     Unnamed: 0 City / Urban area     Country  Population  Land area (in sqKm)
0             0      Buenos Aires   Argentina    11200000                 2266
1             1         Melbourne   Australia     3162000                 2080
2             2            Sydney   Australia     3502000                 1687
3             3          Brisbane   Australia     1508000                 1603
4             4             Perth   Australia     1177000                  964
..          ...               ...         ...         ...                  ...
244         245            Canton         USA      267000                  372
245         246           Spokane         USA      335000                  371
246         247          Tashkent  Uzbekistan     2200000                  531
247         248  Ho Chi Minh City     Vietnam     4900000                  518
248         249            Harare    Zimbabwe     1750000                  712

[249 rows x 5 columns]

In [4]:
df['Country'].unique()

array(['Argentina', 'Australia', 'Austria', 'Azerbaijan', 'Belgium',
       'Brazil', 'Cambodia', 'Canada', 'Chile', 'China', 'Colombia',
       'Congo', 'Denmark', 'Ecuador', 'Egypt', 'Finland', 'France',
       'Germany', 'Ghana', 'Greece', 'Hungary', 'India', 'Indonesia',
       'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy', 'Japan', 'Kuwait',
       'Lebanon', 'Malaysia', 'Mexico', 'Netherlands', 'New Zealand',
       'Nigeria', 'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal',
       'Puerto Rico', 'Russia', 'Saudi', 'Saudi Arabia', 'Singapore',
       'South Africa', 'South Korea', 'Spain', 'Sudan', 'Sweden',
       'Taiwan', 'Thailand', 'Turkey', 'UAE', 'UK', 'Ukraine', 'USA',
       'Uzbekistan', 'Vietnam', 'Zimbabwe'], dtype=object)

In [5]:
df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [6]:
df['City / Urban area'].describe()

count                          249
unique                         249
top       Riverside/San Bernardino
freq                             1
Name: City / Urban area, dtype: object

In [10]:
df[df['Population'] / df['Land area (in sqKm)']>10000].shape

(19, 5)

In [16]:
df['dense']=df['Population'] / df['Land area (in sqKm)']

In [17]:
df.sort_values(by='dense',ascending=False)

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),dense
75,75,Mumbai,India,14350000,484,29648.760331
74,74,Kolkata,India,12700000,531,23917.137476
101,101,Karachi,Pakistan,9800000,518,18918.918919
99,99,Lagos,Nigeria,13400000,738,18157.181572
34,34,Shenzhen,China,8000000,466,17167.381974
...,...,...,...,...,...,...
194,195,Chattanooga,USA,344000,751,458.055925
223,224,Asheville,USA,222000,536,414.179104
57,57,Pau,France,181000,450,402.222222
220,221,Hickory,USA,188000,546,344.322344
196,197,Barnstable Town,USA,244000,741,329.284750

In [18]:
country = df['Country'].value_counts()

In [22]:
country[country==4]

Italy    4
Name: Country, dtype: int64

In [55]:

filter = df['Country'].value_counts()<5
filter

USA         False
France      False
Brazil      False
Canada      False
Germany     False
            ...
Thailand     True
Hungary      True
Egypt        True
Israel       True
Ireland      True
Name: Country, Length: 61, dtype: bool

In [56]:
filter[filter]

Italy           True
Mexico          True
Russia          True
Spain           True
Pakistan        True
Poland          True
UAE             True
Turkey          True
Belgium         True
Congo           True
Saudi Arabia    True
Portugal        True
Taiwan          True
Puerto Rico     True
Malaysia        True
Azerbaijan      True
Austria         True
Finland         True
Vietnam         True
Nigeria         True
Uzbekistan      True
Lebanon         True
Chile           True
Netherlands     True
Greece          True
New Zealand     True
Indonesia       True
Peru            True
Singapore       True
Kuwait          True
Denmark         True
Iran            True
Argentina       True
Colombia        True
Iraq            True
Philippines     True
South Korea     True
Ghana           True
Ecuador         True
Sweden          True
Sudan           True
Cambodia        True
Ukraine         True
Zimbabwe        True
Saudi           True
Thailand        True
Hungary         True
Egypt           True
Israel          True
Ireland         True
Name: Country, dtype: bool

In [58]:
fil2 = list(filter.index)
fil2

['USA',
 'France',
 'Brazil',
 'Canada',
 'Germany',
 'South Africa',
 'Australia',
 'India',
 'China',
 'Japan',
 'UK',
 'Italy',
 'Mexico',
 'Russia',
 'Spain',
 'Pakistan',
 'Poland',
 'UAE',
 'Turkey',
 'Belgium',
 'Congo',
 'Saudi Arabia',
 'Portugal',
 'Taiwan',
 'Puerto Rico',
 'Malaysia',
 'Azerbaijan',
 'Austria',
 'Finland',
 'Vietnam',
 'Nigeria',
 'Uzbekistan',
 'Lebanon',
 'Chile',
 'Netherlands',
 'Greece',
 'New Zealand',
 'Indonesia',
 'Peru',
 'Singapore',
 'Kuwait',
 'Denmark',
 'Iran',
 'Argentina',
 'Colombia',
 'Iraq',
 'Philippines',
 'South Korea',
 'Ghana',
 'Ecuador',
 'Sweden',
 'Sudan',
 'Cambodia',
 'Ukraine',
 'Zimbabwe',
 'Saudi',
 'Thailand',
 'Hungary',
 'Egypt',
 'Israel',
 'Ireland']

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),dense
0,0,Buenos Aires,Argentina,11200000,2266,4942.630185
1,1,Melbourne,Australia,3162000,2080,1520.192308
2,2,Sydney,Australia,3502000,1687,2075.874333
3,3,Brisbane,Australia,1508000,1603,940.736120
4,4,Perth,Australia,1177000,964,1220.954357
...,...,...,...,...,...,...
244,245,Canton,USA,267000,372,717.741935
245,246,Spokane,USA,335000,371,902.964960
246,247,Tashkent,Uzbekistan,2200000,531,4143.126177
247,248,Ho Chi Minh City,Vietnam,4900000,518,9459.459459
248,249,Harare,Zimbabwe,1750000,712,2457.865169